import re
text = "Цены: 100 руб, $50, 75.50 евро, 200₽, 300"
# Задача: Найти все цены с валютами (руб, $, евро, ₽)
print(re.findall(r"\$\d+\.?\d*|\d+\.?\d*(?:\sруб|\sевро|₽", text))
# Ожидаемый результат: ['100 руб', '$50', '75.50 евро', '200₽']

html = "<div>Текст <b>жирный</b> и <i>курсивный</i></div>"
# Задача: Удалить все HTML-теги, оставив только текст
print(re.sub(r"\<.*?>", "", html))
# Ожидаемый результат: "Текст жирный и курсивный"

text = "Версии: Python 3.9, Java 17.0.1, Node.js v18.15.0, проект v1.2.3.4"
# Задача: Найти все номера версий (числа с точками)
print(re.findall(r"\d+(?:\.\d+)*", text))
# Ожидаемый результат: ['3.9', '17.0.1', '18.15.0', '1.2.3.4']

complex_text = """
Клиент Иван Иванов (ivan@mail.com, +7-912-345-67-89) 
заказал товар #12345 за 1,500.50 руб. 
Статус: ВЫПОЛНЕНО. Версия заказа v2.1.5.
Сайт: https://store.com/order/12345
"""

print(email = re.findall(r"\w+@\w+\.\w+", complex_text))
print(phone = re.findall(r"\+7-\d{3}-\d{3}-\d{2}-\d{2}", complex_text))
print(order = re.findall(r"#\d+", complex_text))
print(price = re.findall(r"\d+(?:,\d+)*\.?\d*\s*руб", complex_text))
print(version = re.findall(r"v\d+(?:\.\d+)*", complex_text))

# Задачи:
# 1. Найти email и телефон
# 2. Найти номер заказа (#12345)
# 3. Найти цену (1,500.50 руб)
# 4. Найти версию заказа (v2.1.5)