"""

Задача 1. Простой анализ текста

Условие:
Виртуальный ассистент анализирует сообщения пользователя,
чтобы определить приоритет и тип задачи.

Система должна:

    Вывести на экран сообщение "high priority", есть текст
    содержит слово "срочно" ИЛИ длиннее 50 символов

    Вывести "question" если содержит знак вопроса

    В остальных случаях -> вывести длину сообщения

Пример входных данных:
    Сообщение: "Мне нужно срочно отправить письмо клиенту"
"""
message = "Мне нужно срочно отправить письмо клиенту"
if 'срочно' in message.lower() or len(message) > 50:
    print('high priority')
elif '?' in message:
    print('question')
else:
    print(len(message))

"""

Задача 2. Рекомендательная система

Условие:
Система рекомендует рестораны на основе предпочтений пользователя.

Логика рекомендаций:

    Если бюджет "low" И предпочтение "Italian" -> рекомендовать пиццерию

    Если "vegan" -> рекомендовать вегетарианское кафе

    Если бюджет "high" -> рекомендовать премиум-ресторан

    В остальных случаях вывести на экран "Ищу другие варианты"

Пример входных данных:
    Бюджет: "mid"
    Кухня: "Italian" 
    Вегетарианец: False
"""
budget, cuisine, vegetarian = "mid", "Italian", False
if budget == "low" and cuisine == "Italian":
    print("Рекомендую пиццерию")
elif vegetarian:
    print("Рекомендую вегетарианское кафе")
elif budget == 'high':
    print("Рекомендую премиум-ресторан")
else:
    print("Ищу другие варианты")
"""

Задача 3. Термостат

Условие:
Система умного дома управляет температурой в помещении.

Логика работы:

    Если температура в комнате ниже желаемой И пользователь дома -> 
    включить отопление

    Если температура выше 30 градусов -> включить охлаждение

    Если пользователя нет дома -> включить энергосбережение

    В остальных случаях поддерживать текущий режим

Пример входных данных:
    Температура в комнате: 22°C
    Желаемая температура: 23°C  
    На улице: 15°C
    Пользователь дома: True
"""

temperature = 22
preference = 23
outside_t = 15
customer_at_home = True

if temperature < preference and customer_at_home:
    print("Turn on the heating")
elif temperature > 30:
    print("Turn on cooling")
elif is_custom_at_home == False:
    print("Energy saving modus")
else:
    print("Supporting current state")

"""

Задача 4. Система безопасности умного дома

Условие:
Охранная система мониторит статус дома и реагирует на события.

Логика оповещений:

    Если обнаружено движение НОЧЬЮ -> сигнал тревоги

    Если окно открыто И ночь -> предупреждение

    Если дверь закрыта И окна закрыты -> все в норме

    В остальных случаях стандартный режим

Напишите программу, которая определяет статус безопасности.

Пример входных данных:
    Дверь закрыта: True
    Окна закрыты: False  
    Обнаружено движение: True
    Ночь: True
"""

door_closed = True
window_closed = False
move_detection = True
night = True

if move_detection and night:
    print("Тревога")
elif not window_closed and night:
    print("Предупреждение")
elif door_closed and window_closed:
    print("Все в норме")
else:
    print("Стандартный режим")

"""

Задача 5. Умный навигатор с пробками

Условие:
Навигационная система анализирует дорожную ситуацию 
и предлагает альтернативы.

Логика перенаправления:

    Если уровень пробок выше 7 И есть альтернативный маршрут -> 
    искать объезд

    Если до цели меньше 10 км -> показывать оставшееся время

    Если пробки выше 5 И нет альтернативы -> предупредить о пробках

    В остальных случаях продолжать по текущему маршруту

Напишите программу, которая принимает решение о смене маршрута.

Пример входных данных:
    Уровень пробок: 8/10
    Оставшееся расстояние: 25 км
    Оставшееся время: 45 минут
    Есть альтернативный маршрут: True
"""

traffic_level = 8
distance_left = 35
time_left = 45
alternative = True

if traffic_level > 7 and alternative:
    print("Искать объезд")
elif distance_left < 10:
    print(time_left)
elif traffic_level > 5 and not alternative:
    print("Предупреждаю о пробках")
else:
    print("Продолжать по текущему маршруту")
